In [44]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [6]:
marks = {
    'Name': ['mehul', 'ivan', 'jane'],
    'Roll': [10, 4, 23],
    'Physics': [99, 98, 92],
    'Chemistry': [93, 95, 100]
}
d1 = DataFrame(marks)
print(d1)
print(type(d1))
print(d1.index)
print(d1.columns)

    Name  Roll  Physics  Chemistry
0  mehul    10       99         93
1   ivan     4       98         95
2   jane    23       92        100
<class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Roll', 'Physics', 'Chemistry'], dtype='object')

In [4]:
d1

    Name  Roll  Physics  Chemistry
0  mehul    10       99         93
1   ivan     4       98         95
2   jane    23       92        100

In [9]:
d2 = DataFrame(marks, index=marks['Roll'], columns=['Name','Chemistry', 'Physics'])
d2

     Name  Chemistry  Physics
10  mehul         93       99
4    ivan         95       98
23   jane        100       92

In [18]:
# indexing
print(d2.loc[4])
print(d2.iloc[-1])
print(d2.loc[[10, 23]])
print(d2[['Physics', 'Chemistry']])

print(d2.loc[[10, 23], ['Physics', 'Chemistry']])

Name         ivan
Chemistry      95
Physics        98
Name: 4, dtype: object
Name         jane
Chemistry     100
Physics        92
Name: 23, dtype: object
     Name  Chemistry  Physics
10  mehul         93       99
23   jane        100       92
    Physics  Chemistry
10       99         93
4        98         95
23       92        100
    Physics  Chemistry
10       99         93
23       92        100

In [24]:
print(d2)
# slicing
print(d2.iloc[:2])
print(d2.iloc[-2:])
d3 = d2.iloc[:2]
d4 = d3[['Physics', 'Chemistry']]
d4

     Name  Chemistry  Physics
10  mehul         93       99
4    ivan         95       98
23   jane        100       92
     Name  Chemistry  Physics
10  mehul         93       99
4    ivan         95       98
    Name  Chemistry  Physics
4   ivan         95       98
23  jane        100       92

    Physics  Chemistry
10       99         93
4        98         95

In [28]:
print(d2)
sm = Series([100, 78, 98], index=[23, 10, 4])
print(sm)

     Name  Chemistry  Physics
10  mehul         93       99
4    ivan         95       98
23   jane        100       92
23    100
10     78
4      98
dtype: int64

In [29]:
d2['Maths'] = sm
d2

     Name  Chemistry  Physics  Maths
10  mehul         93       99     78
4    ivan         95       98     98
23   jane        100       92    100

In [34]:
d5 = d2[['Physics', 'Chemistry', 'Maths']]
print(d5.sum(axis=1)) # horizontally
print(d5.mean(axis=0)) # vertically

10    270
4     291
23    292
dtype: int64
Physics      96.333333
Chemistry    96.000000
Maths        92.000000
dtype: float64

In [35]:
d6 = DataFrame({
    'Verbal': [90, 95, 89],
    'Quant': [100, 89, 99]
}, index=[23, 10, 4])
d6

    Verbal  Quant
23      90    100
10      95     89
4       89     99

In [38]:
d10 = d2.merge(d6, left_index=True, right_index=True)
d10

     Name  Chemistry  Physics  Maths  Verbal  Quant
10  mehul         93       99     78      95     89
4    ivan         95       98     98      89     99
23   jane        100       92    100      90    100

In [40]:
d2.loc[10, 'Name'] = 'Mehul'
d2

     Name  Chemistry  Physics  Maths
10  Mehul         93       99     78
4    ivan         95       98     98
23   jane        100       92    100

In [41]:
d10

     Name  Chemistry  Physics  Maths  Verbal  Quant
10  mehul         93       99     78      95     89
4    ivan         95       98     98      89     99
23   jane        100       92    100      90    100

In [42]:
data2 = {
    'Name': ['jill', 'mark'],
    'Physics': [99, 100],
    'Chemistry': [93, 95],
    'Maths': [100, 56],
    'Roll': [20, 12]
}
d11 = DataFrame(data2, index=data2['Roll'], columns=['Name', 'Physics', 'Chemistry', 'Maths'])
d11

    Name  Physics  Chemistry  Maths
20  jill       99         93    100
12  mark      100         95     56

In [47]:
d12 = pd.concat([d10, d11])
d12

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    Chemistry  Maths   Name  Physics  Quant  Verbal
10         93     78  mehul       99   89.0    95.0
4          95     98   ivan       98   99.0    89.0
23        100    100   jane       92  100.0    90.0
20         93    100   jill       99    NaN     NaN
12         95     56   mark      100    NaN     NaN

In [49]:
d13 = d12.fillna(0)
d13

    Chemistry  Maths   Name  Physics  Quant  Verbal
10         93     78  mehul       99   89.0    95.0
4          95     98   ivan       98   99.0    89.0
23        100    100   jane       92  100.0    90.0
20         93    100   jill       99    0.0     0.0
12         95     56   mark      100    0.0     0.0